In [2]:
import pandas as pd

In [3]:
import numpy as np

In [8]:
food=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\restaurant_foods.csv")
food

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [10]:
week1=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\restaurant_week_1_sales.csv")
week1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [11]:
time=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\restaurant_week_1_times.csv")
time

    Time of Day
0      14:54:59
1      20:55:17
2      01:16:22
3      16:17:26
4      19:26:11
..          ...
245    04:44:14
246    07:46:21
247    20:45:08
248    01:09:06
249    18:18:50

[250 rows x 1 columns]

In [12]:
week2=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\restaurant_week_2_sales.csv")
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [13]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [14]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [15]:
len(week1)

250

In [16]:
len(week2)

250

In [18]:
pd.concat([week1,week2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [19]:
pd.concat([week1,week2],ignore_index=False)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [20]:
pd.concat([week1,week2],ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [22]:
pd.concat([week1,week2],keys=["week1","week2"]).sort_index()

           Customer ID  Food ID
week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

In [23]:
df1=pd.DataFrame([1,2,3],columns=["A"])
df1

   A
0  1
1  2
2  3

In [25]:
df2=pd.DataFrame([4,5,6],columns=["B"])
df2

   B
0  4
1  5
2  6

In [28]:
pd.concat([df1,df2])

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [29]:
pd.concat([df1,df2],axis="index")

     A    B
0  1.0  NaN
1  2.0  NaN
2  3.0  NaN
0  NaN  4.0
1  NaN  5.0
2  NaN  6.0

In [31]:
pd.concat([df1,df2],axis="columns")

   A  B
0  1  4
1  2  5
2  3  6

In [32]:
week1.merge(food, how="left",on="Food ID")   # mergerd according to the left table thats why its called left merge

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [1]:
week2.merge(customers,how="left",left_on="Customer ID",right_on="ID")

NameError: name 'week2' is not defined

In [2]:
# exporatory Data analysis is everything we have done till now (merge, data cleaning etc)